/**************************************
FileAndStream.js ver. 2012-12-06
Interface language
Language:      Russian (1049)
Translated by: Аверин Андрей http://tc-image.3dn.ru
**************************************/
sTxtFilter       = "Фильтр";
sTxtFileName     = "Имя";
sTxtStrName      = "Имя NTFS потока";
sTxtSize         = "Размер";
sTxtTime         = "Дата";
sTxtAttrib       = "Атрибуты";
sTxtOpenWin      = "Открыть (Windows)";                                                       //changed
sTxtMenu         = "Меню";
sTxtRename       = "Переимен.";
sTxtView         = "Просмотр";
sTxtEdit         = "Правка";
sTxtCopy         = "Копировать";
sTxtToSecPanel   = "В другую панель";
sTxtToOwnPanel   = "В текущую панель";
sTxtMove         = "Переместить";
sTxtCreate       = "Создать";
sTxtDelete       = "Удалить";
sTxtRefresh      = "Обновить";
sTxtCompare      = "Сравнить";
sTxtNoFiles      = "<нет файлов>";
sTxtNoStreams    = "<нет потоков>";
sTxtNoSupport    = "<диск не поддерживает NTFS потоки>";
sTxtMainStream   = "<без названия - основной поток>";
sTxtNoDrive      = "Диск не доступен. Пожалуйста, выберите другой.";
sTxtNoDirRefr    = "Каталог не существует. Список файлов будет обновлен.";
sTxtNoFileRefr   = "Файл не существует. Список файлов будет обновлен.";
sTxtNoStreamRefr = "Поток не существует. Список потоков будет обновлен.";
sTxtNoDirAcc     = "Отказано в доступе в этот каталог.";
sTxtNoExists     = "Не существует.";
sTxtDirNoExists  = "Каталог не существует.";
sTxtFileNoExists = "Файл не существует.";
sTxtDirExists    = "Каталог уже существует.";
sTxtFileExists   = "Файл уже существует.";
sTxtStrExists    = "Поток уже существует.";
sTxtNameExists   = "Имя уже существует.";
sTxtRenDir       = "Переименование папки";
sTxtRenFile      = "Переименование файла";
sTxtRenStr       = "Переименование stream";
sTxtRenFail      = "Не удалось переименовать.";
sTxtNewName      = "новое имя:";
sTxtCopDir       = "Копирование папки";
sTxtCopFile      = "Копирование файла";
sTxtCopStr       = "Копирование stream";
sTxtCopFail      = "Не удалось скопировать.";
sTxtMovDir       = "Перемещение папки";
sTxtMovFile      = "Перемещение файла";
sTxtMovStr       = "Перемещение stream";
sTxtMovFail      = "Не удалось переместить.";
sTxtWantReplace  = "Уже существует. Хотите заменить его?";
sTxtDirToSubdir  = "Вы не можете копировать/перемещать каталог в подкаталог.";
sTxtFileToStr    = "Вы не можете переместить файл в свой поток.";
sTxtCreDir       = "Создать новый каталог";
sTxtCreFile      = "Создать новый файл";
sTxtCreStr       = "Создать новый поток";
sTxtCreFail      = "Не удалось создать.";
sTxtInpName      = "Введите имя:";
sTxtDelDir       = "Удаление каталога с диска";
sTxtDelDirToBin  = "Удаление каталога в Корзину";
sTxtDelFile      = "Удалить файл с диска";
sTxtDelFileToBin = "Удалить файл в Корзину";
sTxtDelStr       = "Удалить поток";
sTxtDelFail      = "Не удалось удалить.";
sTxtWantDelete   = "Вы хотите удалить?";
sTxtToRecBin     = "В Корзину";
sTxtFromDisk     = "С диска";
sTxtTo           = "в:";
sTxtToFile       = "в file:";
sTxtToStream     = "в поток:";
sTxtBadName      = "Неверное имя.";
sTxtBadChar      = "Имя содержит недопустимый символ";
sTxtRunScript    = "Запуск скрипта AkelPad";
sTxtJsVbsOnly    = "Вы можете запустить только файлы .JS и .VBS";
sTxtNoRunScript  = "Скрипт может быть запущен только с диска, на котором установлен AkelPad.";
sTxtInpArgs      = "Введите аргументы:";
sTxtNoFileProp   = "Ошибка: не может отобразить свойства файла.";
sTxtSetViewer    = "Выберите внешний просмотрщик файлов";
sTxtSetEditor    = "Выберите внешний редактор";
sTxtSetComparer  = "Выберите программу сравнения файлов";
sTxtDispName     = "Отображаемое имя";
sTxtFullName     = "Full name of executable file with path";                                  //changed
sTxtAkelDir      = "каталог AkelPad";
sTxtEnvVar       = "переменная окружения";
sTxtAddPar       = "Дополнительные параметры:";
sTxtMustSpecify  = "Вы должны указать";
sTxtFavorites    = "Избранные";
sTxtAddFavorite  = "Добавить в избранное";
sTxtModFavorite  = "Изменить избранное";
sTxtDelFavorite  = "Удалить из избранного";
sTxtCleFavorite  = "Очистить избранное";
sTxtWantDelFav   = "Вы хотите, удалить из избранного?";
sTxtWantCleFavAp = "Вы хотите, чтобы удалить все избранные приложения?";
sTxtWantCleFavFo = "Вы хотите, чтобы удалить все избранные папки?";
sTxtOpenInFavor  = "Открыть в избранном";
sTxtGoToFavFold  = "Перейти в избранную папку";
sTxtCleHistory   = "Clear history of directories";                                            //new
sTxtSaveHistory  = "Save history on exit";                                                    //new
sTxtAddAssoc     = "Add internal association";                                                //new
sTxtModAssoc     = "Modify association";                                                      //new
sTxtDelAssoc     = "Remove association";                                                      //new
sTxtCleAssoc     = "Clear associations list";                                                 //new
sTxtFileExtSep   = "File name extensions separated by commas";                                //new
sTxtAssocExists  = "Association already exists."                                              //new
sTxtWantDelAssoc = "Do you want to remove internal association of files?";                    //new
sTxtWantCleAssoc = "Do you want to remove all internal associations of files?";               //new
sTxtOpenInAssoc  = "Open (internal association)";                                             //new
sTxtWait         = "Пожалуйста, подождите ...";

//Menu
sTxtFile         = "Файл";
sTxtDrive        = "Диск";
sTxtDirectory    = "Каталог";
sTxtShow         = "Вид";
sTxtWindow       = "Окно";
sTxtApplications = "Команды";
sTxtRun          = "Запуск";
sTxtExit         = "Выход";
sTxtProperties   = "Свойства";
sTxtCopyNames    = "Копировать в буфер...";
sTxtPath         = "Путь";
sTxtStream       = "Поток";
sTxtFilesList    = "Список файлов в каталоге";
sTxtStreamsList  = "Список потоков в файл";
sTxtLeftPanel    = "Левая панель";
sTxtRightPanel   = "Правая панель";
sTxtGoToParent   = "В родительский";
sTxtGoToSubDir   = "В подкаталог";
sTxtGoToMain     = "В корневой";
sTxtFavFolders   = "Избранные папки";
sTxtSpecFolders  = "Специальные папки";
sTxtHistory      = "History";                                                                 //new
sTxtUndo         = "Undo";                                                                    //new
sTxtRedo         = "Redo";                                                                    //new
sTxtRightToLeft  = "Справа налево";
sTxtLeftToRight  = "Слева направо";
sTxtSwapPanels   = "Поменять панели";
sTxtQuickView    = "Быстрый просмотр";
sTxtColumns      = "Колонки";
sTxtOnlyName     = "Только имя";
sTxtAttributes   = "Атрибуты";
sTxtMoveLeft     = "Переместить влево";
sTxtMoveRight    = "Переместить вправо";
sTxtMoveUp       = "Переместить вверх";
sTxtMoveDown     = "Переместить вниз";
sTxtToLeftEdge   = "По левому краю";
sTxtToRightEdge  = "По правому краю";
sTxtToTopEdge    = "По верхнему краю";
sTxtToBottomEdge = "По нижнему краю";
sTxtCenter       = "По центру";
sTxtMaximize     = "Развернуть/Вернуть";
sTxtViewer       = "Просмотр";
sTxtEditor       = "Правка";
sTxtComparer     = "Сравнить";
sTxtCommandLine  = "Командная строка";
sTxtAkelScript   = "Скрипт AkelPad";
sTxtWithoutArgs  = "Без аргументов";
sTxtWithArgs     = "С аргументами";